In [ ]:
# https://leetcode.com/problems/students-and-examinations/

"""
SELECT st.student_id, st.student_name, sb.subject_name, COALESCE(ec.exam_count, 0) AS attended_exams
FROM
    Students st
    CROSS JOIN Subjects sb 
    LEFT JOIN (SELECT COUNT(*) exam_count, student_id, subject_name FROM Examinations GROUP BY student_id, subject_name) ec
    ON ec.student_id = st.student_id AND ec.subject_name = sb.subject_name
ORDER BY st.student_id, sb.subject_name;
"""

# The count of groups could be done in the main table simply

"""
SELECT
    S.student_id
    ,S.student_name
    ,SU.subject_name
    ,COUNT(E.student_id) attended_exams
FROM Students S
CROSS JOIN Subjects SU
LEFT JOIN Examinations E
    ON S.student_id = E.student_id
    AND SU.subject_name = E.subject_name

GROUP BY S.student_id, S.student_name, SU.subject_name
ORDER BY S.student_id, S.student_name, SU.subject_name
;
"""

In [ ]:
# https://leetcode.com/problems/consecutive-numbers/

"""
SELECT DISTINCT l1.num as ConsecutiveNums
FROM Logs l1
LEFT JOIN Logs l2
ON l1.id = l2.id + 1
LEFT JOIN Logs l3
ON l1.id = l3.id + 2
WHERE l1.num = l2.num and l1.num = l3.num;
"""

# Beautiful solution

"""
SELECT DISTINCT num AS ConsecutiveNums
FROM (
SELECT num, a.id - ROW_NUMBER() OVER (PARTITION BY num ORDER BY id) AS label
FROM Logs a
) cte
GROUP BY label, num
HAVING COUNT(num) >= 3;
"""

In [ ]:
# https://leetcode.com/problems/nth-highest-salary/

"""
CREATE OR REPLACE FUNCTION NthHighestSalary(N INT)
  RETURNS TABLE (Salary INT)
AS $$
BEGIN
  RETURN QUERY
    SELECT
      es1.salary
    FROM      (SELECT DISTINCT e1.salary
        FROM Employee e1) es1
      LEFT JOIN (
        SELECT DISTINCT e2.salary
        FROM Employee e2
      ) es2
        ON es1.salary <= es2.salary
    GROUP BY
      es1.salary
    HAVING
      COUNT(es2.salary) = N;
END;
$$ LANGUAGE plpgsql;
"""

# Joins are not mandatory

"""
CREATE OR REPLACE FUNCTION NthHighestSalary(N INT) RETURNS TABLE (Salary INT) AS $$
BEGIN
IF N < 1 THEN 
    RETURN QUERY(SELECT NULL::INT AS salary);
ELSE
  RETURN QUERY (
    SELECT DISTINCT e.salary
      from Employee e
      ORDER BY salary DESC
      LIMIT 1
      OFFSET N-1
  );
 END IF;
END;
$$ LANGUAGE plpgsql;
"""

In [ ]:
# https://leetcode.com/problems/rank-scores/
"""
SELECT score, DENSE_RANK() over (ORDER BY SCORE DESC) rank FROM Scores;
"""

# A non window function solution
"""
SELECT s1.score, (SELECT COUNT(DISTINCT s2.score) FROM Scores s2 WHERE s2.score >= s1.score) AS rank
FROM Scores s1
ORDER BY s1.score DESC;
"""

# Also possible and better on SQL engines:
"""
SELECT s1.score, COUNT(DISTINCT s2.score) AS rank
FROM Scores s1
LEFT JOIN Scores s2 ON s1.score <= s2.score
GROUP BY s1.score
ORDER BY s1.score DESC;
"""

In [ ]:
# https://leetcode.com/problems/not-boring-movies/

"""SELECT * FROM Cinema
WHERE mod(id,2) = 1 AND description != 'boring'
ORDER BY rating DESC;"""

In [ ]:
# https://leetcode.com/problems/triangle-judgement/submissions/1639090104/

"""
SELECT x, y, z,
(
CASE
  WHEN LEAST(x, y, z) + (x + y + z) - LEAST(x, y, z) - GREATEST(x, y, z) > GREATEST(x, y, z) THEN 'Yes'
  ELSE 'No'
END
) AS triangle
FROM Triangle;
"""

In [ ]:
# https://leetcode.com/problems/sales-person/submissions/1638196688/

"""
SELECT name FROM SalesPerson
WHERE name NOT IN
(SELECT sp.name
FROM SalesPerson sp
LEFT JOIN Orders o
  ON sp.sales_id = o.sales_id
LEFT JOIN Company c
  ON o.com_id = c.com_id
WHERE c.name = 'RED')
"""

In [ ]:
# https://leetcode.com/problems/classes-more-than-5-students/

"""
SELECT class
FROM Courses
GROUP BY class
HAVING count(student) >= 5;
"""

In [ ]:
# https://leetcode.com/problems/big-countries/submissions/1636368416/

"""
SELECT name, population, area
FROM World
WHERE area >= 3000000 OR population >= 25000000;
"""

In [ ]:
# https://leetcode.com/problems/customer-placing-the-largest-number-of-orders/

"""
SELECT customer_number
FROM Orders
GROUP BY customer_number
ORDER BY count(order_number) DESC
LIMIT 1;
"""

In [ ]:
# https://leetcode.com/problems/find-customer-referee/

"""
SELECT name
FROM Customer
WHERE referee_id != 2 OR referee_id IS NULL;
"""

In [ ]:
# https://leetcode.com/problems/employee-bonus/

"""
SELECT e.name, b.bonus
FROM Employee e 
LEFT JOIN Bonus b
ON e.empId = b.empId
WHERE b.bonus < 1000 OR b.bonus IS NULL;
"""

In [ ]:
# https://leetcode.com/problems/game-play-analysis-i/submissions/1629984989/

"""
SELECT player_id, min(event_date) as first_login
FROM Activity
GROUP BY player_id
ORDER BY player_id;
"""

In [ ]:
# https://leetcode.com/problems/rising-temperature/

"""
select w1.id 
from Weather w1
left join Weather w2
on w1.recordDate = w2.recordDate + INTERVAL '1 day'
where w1.temperature > w2.temperature;
"""

In [ ]:
# https://leetcode.com/problems/delete-duplicate-emails

"""
DELETE FROM Person p1
USING Person p2 
WHERE p1.email = p2.email
AND p1.id > p2.id;
"""

In [ ]:
# https://leetcode.com/problems/customers-who-never-order/

"""
SELECT c.name as Customers
FROM Customers c LEFT JOIN Orders o ON c.id = o.customerId
WHERE o.id IS NULL;
"""

In [ ]:
# https://leetcode.com/problems/second-highest-salary/

"""
select max(salary) as SecondHighestSalary
from Employee
where salary < (select max(salary) from Employee)
"""

In [ ]:
# https://leetcode.com/problems/employees-earning-more-than-their-manage

"""
SELECT e.name Employee
FROM Employee e
LEFT JOIN Employee m
ON e.managerId = m.id
WHERE e.managerId IS NOT NULL
AND e.salary > m.salary;
"""

In [ ]:
# https://leetcode.com/problems/duplicate-emails/

"""
postgresql []
SELECT email
FROM Person
GROUP BY email
HAVING count(*) > 1;
"""

In [ ]:
# https://leetcode.com/problems/combine-two-tables/

"""
SELECT p.firstName, p.lastName, a.city, a.state
FROM Person p
LEFT JOIN Address a
ON p.personId = a.personId
"""